using UnityEngine;
using System;
using System.Collections;
using System.Collections.Generic;
using J2y.Network;


namespace J2y.MultiDroneUnity
{
    //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    //
    // MdusNetServer
    //
    //
    //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

    public class MdusNetServer : NetTcpServer
    {
        public static MdusNetServer Instance;

        //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
        // 변수	
        //
        //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


        //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
        // 메인 함수
        //
        //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

        #region [초기화] 생성자
        //------------------------------------------------------------------------------------------------------------------------------------------------------
        public MdusNetServer()
        {
            Instance = this;
        }
        #endregion



        //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
        // 네트워크
        //
        //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


        #region [이벤트] 네트워크 연결
        //------------------------------------------------------------------------------------------------------------------------------------------------------
        public override void OnClientConnected(NetTcpClient net_client)
        {
            base.OnClientConnected(net_client);

            JLogger.Write("[NetServer_main] Connected client.");

            //var user = JObjectManager.Create<MdusNetClient_User>();
            //net_client.Tag = user;
            //user.NetPeer = net_client;
        }
        #endregion

        #region [이벤트] 네트워크 끊김
        //------------------------------------------------------------------------------------------------------------------------------------------------------
        public override void OnClientDisconnected(NetTcpClient net_client)
        {
            JLogger.Write("[NetServer_main] OnClientDisconnected");

            var obj = net_client.Tag as JObject;
            if (obj != null)
                JObject.DestroyObject(obj);

            base.OnClientDisconnected(net_client);
        }
        #endregion

        
    }

}
